//

Editor.roads = {
	".": { t:"Тропинка (+0)", ha:0 },
	",": { t:"Тропа (+5)", ha:5 },
	":": { t:"Дорога (+10)", ha:10 },
	";": { t:"Брусчатая дорога (+15)", ha:15 },
	"-": { t:"Грунтовая дорога (+20)", ha:20 },
	"=": { t:"Мостовая (+25)", ha:25 },
	"&": { t:"Мощёная улица (+25)", ha:25 },
	"@": { t:"Клинкерная дорога (+45)", ha:45 },
};

Editor.buildings = {
	"sq":   { c:".", w:4, h:4, t:"+16 кв.", sq:true },
	"main": { c:",", w:7, h:6, t:"Ратуша" },
	"4x4":  { c:":", w:4, h:4 },
	"3x3":  { c:";", w:3, h:3 },
	"2x2":  { c:"-", w:2, h:2 },
	"1x1":  { c:"=", w:1, h:1 },
	"5x4":  { c:"&", w:5, h:4 },
	"4x5":  { c:"@", w:4, h:5 },
	"5x3":  { c:"!", w:5, h:3 },
	"3x4":  { c:"$", w:3, h:4 },
	"4x3":  { c:"~", w:4, h:3 },
	"3x2":  { c:"^", w:3, h:2 },
	"2x3":  { c:"`", w:2, h:3 },
	"3x1":  { c:"[", w:3, h:1 },
	"3x5":  { c:"]", w:3, h:5 },
	"5x5":  { c:"(", w:5, h:5 },
	"4x2":  { c:")", w:4, h:2 },
	"GB":   { c:"{" },
	"2x1":  { c:"}", w:2, h:1 },
};

Editor.buildings["GB"].ch = {
	".": { t:"Вавилонская башня", w:4, h:4, p:1140 },
	",": { t:"Статуя Зевса", w:2, h:3 },
	":": { t:"Колизей", w:6, h:7 },
	";": { t:"Александрийский маяк", w:4, h:4 },
	"-": { t:"Софийский собор", w:7, h:6 },
	"=": { t:"Ахенский собор", w:4, h:6 },
	"&": { t:"Базилика Сан-Марко", w:6, h:6 },
	"@": { t:"Нотр-Дам", w:4, h:6 },
	"!": { t:"Собор Василия Блаженного", w:5, h:5 },
	"$": { t:"Замок Дель Монте", w:5, h:5 },
	"~": { t:"Замок Дил", w:7, h:7 },
	"^": { t:"Фрауэнкирхе", w:5, h:5 },
};

Editor.buildings["main"].ch = {
	".": { t:"Ратуша: Каменный век" },
	",": { t:"Ратуша: Бронзовый век" },
	":": { t:"Ратуша: Железный век" },
	";": { t:"Ратуша: Раннее средневековье" },
	"-": { t:"Ратуша: Высокое средневековье" },
	"=": { t:"Ратуша: Позднее средневековье" },
	"&": { t:"Ратуша: Колониальный век" },
	"*": {  },
};

Editor.buildings["5x5"].ch = {
	".": { t:"Бродячий цирк", ha:2800 },
	"*": {  },
};

Editor.buildings["5x4"].ch = {
	".": { t:"Фруктовая плантация", p:-50 },
	"*": {  },
};

Editor.buildings["5x3"].ch = {
	".": { t:"Стрельбище мушкетёров", p:-737 },
	"*": {  },
};

Editor.buildings["4x5"].ch = {
	".": { t:"Козья ферма", p:-122 },
	",": { t:"Ферма", p:-269 },
	"*": {  },
};

Editor.buildings["4x4"].ch = {
	".": { t:"Бассейн", ha:570 },
	",": { t:"Академия", ha:980 },
	":": { t:"Амфитеатр", ha:880 },
	";": { t:"Библиотека", ha:940 },
	"-": { t:"Дворец", ha:1500 },
	"=": { t:"Каменоломня", p:-108 },
	"&": { t:"Известняковая каменоломня", p:-230 },
	"@": { t:"Обработка черного дерева", p:-230 },
	"!": { t:"Гранитная каменоломня", p:-340 },
	"$": { t:"Литейная латуни", p:-580 },
	"~": { t:"Базальтовая каменоломня", p:-580 },
	"^": { t:"Конюшня тяжеловооружённых рыцарей", p:-846 },
	"[": { t:"Табачная плантация", p:-365 },
	"]": { t:"Фарфоровая мануфактура", p:-720 },
	"*": {  },
};

Editor.buildings["4x3"].ch = {
	".": { t:"Театр", ha:540 },
	",": { t:"Гончарня", p:-41 },
	":": { t:"Мясник", p:-66 },
	";": { t:"Пекарня", p:-103 },
	"-": { t:"Сукновальня", p:-230 },
	"=": { t:"Златокузнец", p:-340 },
	"&": { t:"Литейная красной меди", p:-340 },
	"@": { t:"Гипсовая мануфактура", p:-340 },
	"!": { t:"Кирпичный цех", p:-460 },
	"$": { t:"Травник", p:-460 },
	"~": { t:"Стеклодув", p:-460 },
	"^": { t:"Стрельбище баллистиков", p:-170 },
	"[": { t:"Казармы гренадёров", p:-1013 },
	"]": { t:"Конюшни драгунов", p:-921 },
	"*": {  },
};

Editor.buildings["4x2"].ch = {
	".": { t:"Лагерь рейнджеров", p:-829 },
	",": { t:"Конфетная фабрика", p:-130 },
	"*": {  },
};

Editor.buildings["3x5"].ch = {
	".": { t:"Смолокурня", p:-720 },
	"*": {  },
};

Editor.buildings["3x4"].ch = {
	".": { t:"Портной", p:-88 },
	",": { t:"Ветряная мельница", p:-148 },
	":": { t:"Бондарня", p:-164 },
	";": { t:"Ювелир", p:-230 },
	"-": { t:"Солеварня", p:-460 },
	"=": { t:"Конюшня конных <s>коней</s> воинов", p:-170 },
	"&": { t:"Стрельбище конных лучников", p:-206 },
	"@": { t:"Конюшня для тяжелой кавалерии", p:-335 },
	"!": { t:"Конюшня рыцарей", p:-563 },
	"$": { t:"Казармы королевских стражников", p:-716 },
	"~": { t:"Литейная пушек", p:-846 },
	"`": { t:"Здание торговой компании", ha:900 },
	"^": { t:"Лагерь полевых пушек", p:-1105 },
	"*": {  },
};

Editor.buildings["3x3"].ch = {
	".": { t:"Кромлех", ha:182 },
	",": { t:"Школа", ha:240 },
	":": { t:"Таверна", ha:280 },
	";": { t:"Торговая площадь", ha:430 },
	"-": { t:"Гостиный двор", ha:330 },
	"=": { t:"Церковь", ha:520 },
	"&": { t:"Дом лекаря", ha:470 },
	"!": { t:"Типография", ha:780 },
	"@": { t:"Хижина охотника", p:-28 },
	"$": { t:"Кожевня", p:-54 },
	"~": { t:"Обувная мастерская", p:-77 },
	"`": { t:"Лавка специй", p:-86 },
	"^": { t:"Пивоварня", p:-136 },
	"[": { t:"Винодельня", p:-108 },
	"]": { t:"Красильня", p:-108 },
	"(": { t:"Мраморная каменоломня", p:-108 },
	")": { t:"Лесопилка", p:-108 },
	"{": { t:"Литейная железа", p:-230 },
	"}": { t:"Пасека", p:-340 },
	"<": { t:"Резчик талька", p:-580 },
	">": { t:"Пороховая фабрика", p:-580 },
	"а": { t:"Шелкопрядильная мастерская", p:-580 },
	"б": { t:"Казармы копов", p:-26 },
	"в": { t:"Конюшня всадников", p:-56 },
	"г": { t:"Казармы воинов", p:-47 },
	"д": { t:"Мастерская камнеметов", p:-56 },
	"е": { t:"Казармы легионеров", p:-144 },
	"ж": { t:"Казармы наемников", p:-155 },
	"з": { t:"Казармы бронированной пехоты", p:-284 },
	"и": { t:"Мастерская катапульт", p:-335 },
	"к": { t:"Казармы берсерков", p:-260 },
	"л": { t:"Стрельбище арбалетчиков", p:-346 },
	"м": { t:"Казармы тяжелой пехоты", p:-476 },
	"н": { t:"Мастерская требушетов", p:-563 },
	"о": { t:"Казармы воинов с двуручным мечом", p:-391 },
	"п": { t:"Стрельбище длиннолучников", p:-521 },
	"р": { t:"Парусная мастерская", p:-147 },
	"с": { t:"Кофеобжарочная фабрика", p:-720 },
	"т": { t:"Волочильная установка", p:-720 },
	"у": { t:"Кладбище (+890)", ha:890 },
	"*": {  },
};

Editor.buildings["3x2"].ch = {
	".": { t:"Триумфальная арка", ha:190 },
	",": { t:"Дом картографа", ha:320 },
	":": { t:"Лаборатория алхимика", p:-40 },
	";": { t:"Канатная мастерская", p:-460 },
	"-": { t:"Казармы солдат", p:-79 },
	"=": { t:"Парфюмер", p:-78 },
	"&": { t:"Часовщик", p:-68 },
	"!": { t:"Парикмахерская", ha:440 },
	"@": { t:"Лавка экзотических товаров", ha:400 },
	"*": {  },
};

Editor.buildings["3x1"].ch = {
	".": { t:"Акведук", ha:155 },
	"*": {  },
};

Editor.buildings["2x3"].ch = {
	".": { t:"Стрельбище пращиков", p:-34 },
	",": { t:"Бумажная фабрика", p:-720 },
	"*": {  },
};

Editor.buildings["2x2"].ch = {
	"=": { t:"Хижина", p:14 },
	"!": { t:"Свайное жилище", p:22 },
	"@": { t:"Постройка с соломенной крышей", p:27 },
	"&": { t:"Шале", p:32 },
	":": { t:"Дом с черепичной крышей", p:44 },
	"$": { t:"Фахверк", p:67 },
	";": { t:"Коттедж", p:73 },
	"-": { t:"Вилла", p:87 },
	"]": { t:"Многоэтажный дом", p:89 },
	"`": { t:"Дом из песчаника", p:94 },
	"~": { t:"Дом с гонтовой кровлей", p:111 },
	")": { t:"Усадьба", p:123 },
	"(": { t:"Городской особняк", p:156 },
	"^": { t:"Особняк", p:188 },
	"{": { t:"Многоквартирный дом", p:205 },
	"}": { t:"Манор", p:246 },
	"<": { t:"Кузнец", p:-12 },
	"в": { t:"Стрельбище лучников", p:-105 },
	">": { t:"Памятник", ha:72, d:true },
	"[": { t:"Пруд", ha:126, d:true },
	"а": { t:"Группа деревьев", ha:160, d:true },
	"б": { t:"Разрушенная башня", ha:200, d:true },
	".": { t:"Виселица", ha:160 },
	",": { t:"Позорный столб", ha:300 },
	"г": { t:"Дом на плантации", p:311 },
	"ж": { t:"Голландский дом", p:259 },
	"е": { t:"Загородный дом", p:207 },
	"д": { t:"Дом с арками", p:155 },
	"з": { t:"Башня с часами", ha:201 },
	"и": { t:"Фонтан Нептуна", ha:188 },
	"к": { t:"Гильотина", ha:193 },
	"л": { t:"Дерево любви", ha:370 },
	"*": {  },
};

Editor.buildings["2x1"].ch = {
	".": { t:"Щелкунчик (+167)", ha:167 },
	"*": {  },
};

Editor.buildings["1x1"].ch = {
	"~": { t:"Дерево", ha:18 },
	"]": { t:"Менгир", ha:18 },
	".": { t:"Куст", ha:20 },
	",": { t:"Цветы", ha:20 },
	"-": { t:"Статуя", ha:21 },
	"}": { t:"Цветочная грядка", ha:22 },
	":": { t:"Изгородь", ha:22 },
	"{": { t:"Фонтан (дурацкий)", ha:23 },
	")": { t:"Статуя на пьедестале", ha:26 },
	"&": { t:"Цветочный куст", ha:27 },
	"@": { t:"Цветочная изгородь", ha:29 },
	"!": { t:"Забор", ha:30 },
	"^": { t:"Указательный столб", ha:32 },
	"`": { t:"Флаг", ha:32 },
	"[": { t:"Фонарь", ha:35 },
	"а": { t:"Горшочный цветок", ha:36 },
	"<": { t:"Морская скульптура", ha:39 },
	";": { t:"Обелиск", ha:57 },
	"(": { t:"Статуя победы", ha:60 },
	"=": { t:"Кипарис", ha:67 },
	"$": { t:"Горгулья", ha:73 },
	">": { t:"Фонтан", ha:85 },
	"ж": { t:"Куср Орёл", ha:40 },
	"в": { t:"Куст Павлин", ha:48 },
	"б": { t:"Куст Фламинго", ha:52 },
	"г": { t:"Глобус", ha:50 },
	"д": { t:"Декоративное деревце", ha:105 },
	"е": { t:"Воздушный змей", ha:48 },
	"*": {  },
};

//	"": { t:"", ha: },
